Tekla Open API Reference for Tekla Structures 2025
DetailMarkSymbolAttributes Properties
The DetailMarkSymbolAttributes type exposes the following members.
Properties
Name | Description
Shape
 The shape of the mark symbol.
 (Inherited from ViewMarkBasicSymbolAttributes.)
Size
 The size of the mark symbol.
 (Inherited from ViewMarkBasicSymbolAttributes.)
Top
See Also
Reference
DetailMarkSymbolAttributes Class
Tekla.Structures.Drawing Namespace